In [1]:
import pandas as pd
import numpy as np

In [2]:
apr = pd.read_csv(r'../../../data/uber-raw-data-apr14.csv')

In [3]:
apr.head()

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

In [4]:
apr.dtypes

Date/Time     object
Lat          float64
Lon          float64
Base          object
dtype: object

In [5]:
from datetime import datetime

In [6]:
apr['Date/Time'].iloc[0]

'4/1/2014 0:11:00'

In [11]:
# call datetime.strptime to convert
# it into datetime datatype
datetime_obj = datetime.strptime(apr['Date/Time'].iloc[0], 
                                 "%m/%d/%Y %H:%M:%S")

  
# extract the time from datetime_obj
hours = datetime_obj.time().hour
print(hours)

0

In [12]:
apr['Hour'] = apr['Date/Time'].apply(lambda x: datetime.strptime(x, "%m/%d/%Y %H:%M:%S").time().hour)

In [15]:
apr.tail()

                 Date/Time      Lat      Lon    Base  Hour
564511  4/30/2014 23:22:00  40.7640 -73.9744  B02764    23
564512  4/30/2014 23:26:00  40.7629 -73.9672  B02764    23
564513  4/30/2014 23:31:00  40.7443 -73.9889  B02764    23
564514  4/30/2014 23:32:00  40.6756 -73.9405  B02764    23
564515  4/30/2014 23:48:00  40.6880 -73.9608  B02764    23

In [16]:
apr.head()

          Date/Time      Lat      Lon    Base  Hour
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512     0
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512     0
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512     0
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512     0
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512     0

In [17]:
apr.drop('Date/Time', axis=1, inplace=True)

In [21]:
apr.head()

       Lat      Lon    Base  Hour
0  40.7690 -73.9549  B02512     0
1  40.7267 -74.0345  B02512     0
2  40.7316 -73.9873  B02512     0
3  40.7588 -73.9776  B02512     0
4  40.7594 -73.9722  B02512     0